cya-ga-umai/CAN_for_dsPIC30F4012/my_can.c
/******************************************************************************
 *  ファイル名： my_can.c
 * 　 作成日時： 2015/11/09
 * 　　　 機能： CAN通信
 ******************************************************************************/

/******************************************************************************
 * ヘッダファイル
 ******************************************************************************/
#include <xc.h>
#include "mycan.h"

/******************************************************************************
 * グローバル変数
 ******************************************************************************/
unsigned char CAN1RX0Flag = 0;
unsigned char CAN1RX1Flag = 0;

/******************************************************************************
 * 関数プロトタイプ
 ******************************************************************************/
static void CAN1_send_buffer_8(unsigned char buffer_no, unsigned char *data, unsigned char datalen);
static void CAN1_send_buffer_16(unsigned char buffer_no, unsigned int *data, unsigned char datalen);
static void CAN1_send_buffer_32(unsigned char buffer_no, unsigned long *data, unsigned char datalen);

static void CAN1_read_buffer_8(unsigned char buffer_no, unsigned char *data);
static void CAN1_read_buffer_16(unsigned char buffer_no, unsigned int *data);
static void CAN1_read_buffer_32(unsigned char buffer_no, unsigned long *data);

/******************************************************************************
 * CAN1モジュール初期化関数
 ******************************************************************************/
void CAN1_init(void) {
    CAN1_set_OPmode(CAN_REQ_OPERMODE_CONFIG);
    C1CTRLbits.CANCKS = 1;          /* Fcan = Fcy = 29.48[MHz]に設定 */

    C1CFG1bits.SJW = 00;            /* ジャンプ幅は1 x TQに設定 */

    C1CFG1bits.BRP = BRP_VAL;       /* ((FCY/(2*NTQ*BITRATE))-1) */

    C1CFG2 = 0x03F5;                // SEG1PH=6Tq, SEG2PH=3Tq, PRSEG=5Tq 
                                    // Sample 3 times
                                    // Each bit time is 15Tq

    C1INTF = 0;                     /* CAN割り込みフラグレジスタをクリア */
    IFS1bits.C1IF = 0;              /* 入力キャプチャ1 割り込みフラグをクリア */
    C1INTE = 0x00FF;                /* CAN1全割り込み有効 */
    IEC1bits.C1IE = 1;              /* CAN割り込み許可 */
    C1RX0CON = C1RX1CON = 0x0000;   /* 受信バッファレジスタを初期化 */
}

/******************************************************************************
 * CAN1モジュール動作モード設定関数
 ******************************************************************************/
void CAN1_set_OPmode(unsigned char mode){
    C1CTRLbits.REQOP = mode;
    while (C1CTRLbits.OPMODE != mode);
}

/******************************************************************************
 * CAN1モジュールマスク設定関数
 ******************************************************************************/
void CAN1_set_mask(unsigned char mask_no, unsigned int sid, unsigned long eid, unsigned char mide){
    switch (mask_no){
        default: /* mask_no = 0 */
            C1RXM0SIDbits.SID       = sid;
            C1RXM0SIDbits.MIDE      = mide;         /* 一致したメッセージの処遇 */
            C1RXM0EIDH              = eid >> 6;     /* EIDの上位ビット */
            C1RXM0EIDLbits.EID5_0   = eid & 0x3F;   /* EIDの下位ビット */
            break;
        case 1:
            C1RXM1SIDbits.SID       = sid;
            C1RXM1SIDbits.MIDE      = mide;
            C1RXM1EIDH              = eid >> 6;
            C1RXM1EIDLbits.EID5_0   = eid & 0x3F;
            break;
    }
}

/******************************************************************************
 * CAN1モジュールフィルタ設定関数
 ******************************************************************************/
void CAN1_set_filter(unsigned char filter_no, unsigned char id_type, unsigned int sid, unsigned long eid){
    switch (filter_no){
        default:/* fillter_no = 0 */
            C1RXF0SIDbits.EXIDE     = id_type;      /* EIDフィルタの設定 */
            C1RXF0SIDbits.SID       = sid;
            C1RXF0EIDH              = eid >> 6;     /* EID上位ビット */
            C1RXF0EIDLbits.EID5_0   = eid & 0x3F;   /* EID下位ビット */
            break;
        case 1:
            C1RXF1SIDbits.EXIDE     = id_type;
            C1RXF1SIDbits.SID       = sid;
            C1RXF1EIDH              = eid >> 6;
            C1RXF1EIDLbits.EID5_0   = eid & 0x3F;
            break;
        case 2:
            C1RXF2SIDbits.EXIDE     = id_type;
            C1RXF2SIDbits.SID       = sid;
            C1RXF2EIDH              = eid >> 6;
            C1RXF2EIDLbits.EID5_0   = eid & 0x3F;
            break;
        case 3:
            C1RXF3SIDbits.EXIDE     = id_type;
            C1RXF3SIDbits.SID       = sid;
            C1RXF3EIDH              = eid >> 6;
            C1RXF3EIDLbits.EID5_0   = eid & 0x3F;
            break; 
        case 4:
            C1RXF4SIDbits.EXIDE     = id_type;
            C1RXF4SIDbits.SID       = sid;
            C1RXF4EIDH              = eid >> 6;
            C1RXF4EIDLbits.EID5_0   = eid & 0x3F;
            break;
        case 5:
            C1RXF5SIDbits.EXIDE     = id_type;
            C1RXF5SIDbits.SID       = sid;
            C1RXF5EIDH              = eid >> 6;
            C1RXF5EIDLbits.EID5_0   = eid & 0x3F;
            break;
    }
}

/******************************************************************************
 * CAN1モジュールメッセージ送信関数
 ******************************************************************************/
void CAN1_send_message_8(unsigned char buffer_no, unsigned char id_type, unsigned char msg_type, 
        unsigned char priority, unsigned int sid, unsigned long eid, unsigned char *data, unsigned char datalen){
    CAN1_send_buffer_8(buffer_no, data, datalen);
    switch (buffer_no){
        default:
            C1TX0CONbits.TXPRI              = priority;     /* メッセージの優先順位 */
            C1TX0SIDbits.TXIDE              = id_type;      /* EID使用か */
            
            C1TX0SIDbits.SRR                = msg_type;     /* 標準かリモートか */
            if (id_type) C1TX0DLCbits.TXRTR = msg_type;     /* EIDが有効ならばTXRTRも有効 */
            
            C1TX0SIDbits.SID10_6            = sid >> 6;
            C1TX0SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX0EIDbits.EID17_14           = eid >> 14;
            C1TX0EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX0DLCbits.EID5_0             = eid & 0x3F;
            
