cya-ga-umai/CAN_for_dsPIC30F4012/my_can.c
            C1TX0DLCbits.DLC                = datalen;      /* データバイト数 */   
            C1TX0DLCbits.TXRB0 = C1TX0DLCbits.TXRB1 = 1;    /* プロトコル上1にセットする必要あり */
            C1TX0CONbits.TXREQ              = 1;            /* 送信要求 */
            
            break;
        case 1:
            C1TX1CONbits.TXPRI              = priority;
            C1TX1SIDbits.TXIDE              = id_type;
            
            C1TX1SIDbits.SRR                = msg_type;
            if (id_type) C1TX1DLCbits.TXRTR = msg_type;
            
            C1TX1SIDbits.SID10_6            = sid >> 6;
            C1TX1SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX1EIDbits.EID17_14           = eid >> 14;
            C1TX1EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX1DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX1DLCbits.DLC                = datalen;
            C1TX1DLCbits.TXRB0 = C1TX1DLCbits.TXRB1 = 1;
            C1TX1CONbits.TXREQ              = 1;
            
            break;
        case 2:
            C1TX2CONbits.TXPRI              = priority;
            C1TX2SIDbits.TXIDE              = id_type;
            
            C1TX2SIDbits.SRR                = msg_type;
            if (id_type) C1TX2DLCbits.TXRTR = msg_type;
            
            C1TX2SIDbits.SID10_6            = sid >> 6;
            C1TX2SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX2EIDbits.EID17_14           = eid >> 14;
            C1TX2EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX2DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX2DLCbits.DLC                = datalen;
            C1TX2DLCbits.TXRB0 = C1TX2DLCbits.TXRB1 = 1;
            C1TX2CONbits.TXREQ              = 1;
            
            break;
    }
}

void CAN1_send_message_16(unsigned char buffer_no, unsigned char id_type, unsigned char msg_type, 
        unsigned char priority, unsigned int sid, unsigned long eid, unsigned int *data, unsigned char datalen){
    CAN1_send_buffer_16(buffer_no, data, datalen);
    switch (buffer_no){
        default:
            C1TX0CONbits.TXPRI              = priority;     /* メッセージの優先順位 */
            C1TX0SIDbits.TXIDE              = id_type;      /* EID使用か */
            
            C1TX0SIDbits.SRR                = msg_type;     /* 標準かリモートか */
            if (id_type) C1TX0DLCbits.TXRTR = msg_type;     /* EIDが有効ならばTXRTRも有効 */
            
            C1TX0SIDbits.SID10_6            = sid >> 6;
            C1TX0SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX0EIDbits.EID17_14           = eid >> 14;
            C1TX0EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX0DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX0DLCbits.DLC                = datalen;      /* データバイト数 */   
            C1TX0DLCbits.TXRB0 = C1TX0DLCbits.TXRB1 = 1;    /* プロトコル上1にセットする必要あり */
            C1TX0CONbits.TXREQ              = 1;            /* 送信要求 */
            
            break;
        case 1:
            C1TX1CONbits.TXPRI              = priority;
            C1TX1SIDbits.TXIDE              = id_type;
            
            C1TX1SIDbits.SRR                = msg_type;
            if (id_type) C1TX1DLCbits.TXRTR = msg_type;
            
            C1TX1SIDbits.SID10_6            = sid >> 6;
            C1TX1SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX1EIDbits.EID17_14           = eid >> 14;
            C1TX1EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX1DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX1DLCbits.DLC                = datalen;
            C1TX1DLCbits.TXRB0 = C1TX1DLCbits.TXRB1 = 1;
            C1TX1CONbits.TXREQ              = 1;
            
            break;
        case 2:
            C1TX2CONbits.TXPRI              = priority;
            C1TX2SIDbits.TXIDE              = id_type;
            
            C1TX2SIDbits.SRR                = msg_type;
            if (id_type) C1TX2DLCbits.TXRTR = msg_type;
            
            C1TX2SIDbits.SID10_6            = sid >> 6;
            C1TX2SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX2EIDbits.EID17_14           = eid >> 14;
            C1TX2EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX2DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX2DLCbits.DLC                = datalen;
            C1TX2DLCbits.TXRB0 = C1TX2DLCbits.TXRB1 = 1;
            C1TX2CONbits.TXREQ              = 1;
            
            break;
    }
}

void CAN1_send_message_32(unsigned char buffer_no, unsigned char id_type, unsigned char msg_type, 
        unsigned char priority, unsigned int sid, unsigned long eid, unsigned long *data, unsigned char datalen){
    CAN1_send_buffer_32(buffer_no, data, datalen);
    switch (buffer_no){
        default:
            C1TX0CONbits.TXPRI              = priority;     /* メッセージの優先順位 */
            C1TX0SIDbits.TXIDE              = id_type;      /* EID使用か */
            
            C1TX0SIDbits.SRR                = msg_type;     /* 標準かリモートか */
            if (id_type) C1TX0DLCbits.TXRTR = msg_type;     /* EIDが有効ならばTXRTRも有効 */
            
            C1TX0SIDbits.SID10_6            = sid >> 6;
            C1TX0SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX0EIDbits.EID17_14           = eid >> 14;
            C1TX0EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX0DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX0DLCbits.DLC                = datalen;      /* データバイト数 */   
            C1TX0DLCbits.TXRB0 = C1TX0DLCbits.TXRB1 = 1;    /* プロトコル上1にセットする必要あり */
            C1TX0CONbits.TXREQ              = 1;            /* 送信要求 */
            
            break;
        case 1:
            C1TX1CONbits.TXPRI              = priority;
            C1TX1SIDbits.TXIDE              = id_type;
            
            C1TX1SIDbits.SRR                = msg_type;
            if (id_type) C1TX1DLCbits.TXRTR = msg_type;
            
