cya-ga-umai/CAN_for_dsPIC30F4012/my_can.c
            C1TX1SIDbits.SID10_6            = sid >> 6;
            C1TX1SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX1EIDbits.EID17_14           = eid >> 14;
            C1TX1EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX1DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX1DLCbits.DLC                = datalen;
            C1TX1DLCbits.TXRB0 = C1TX1DLCbits.TXRB1 = 1;
            C1TX1CONbits.TXREQ              = 1;
            
            break;
        case 2:
            C1TX2CONbits.TXPRI              = priority;
            C1TX2SIDbits.TXIDE              = id_type;
            
            C1TX2SIDbits.SRR                = msg_type;
            if (id_type) C1TX2DLCbits.TXRTR = msg_type;
            
            C1TX2SIDbits.SID10_6            = sid >> 6;
            C1TX2SIDbits.SID5_0             = sid & 0x3F;
            
            C1TX2EIDbits.EID17_14           = eid >> 14;
            C1TX2EIDbits.EID13_6            = (eid >> 6) & 0xFF;
            C1TX2DLCbits.EID5_0             = eid & 0x3F;
            
            C1TX2DLCbits.DLC                = datalen;
            C1TX2DLCbits.TXRB0 = C1TX2DLCbits.TXRB1 = 1;
            C1TX2CONbits.TXREQ              = 1;
            
            break;
    }
}

/******************************************************************************
 * CAN1モジュール送信バッファ書き込み関数（スタティック）
 ******************************************************************************/
static void CAN1_send_buffer_8(unsigned char buffer_no, unsigned char *data, unsigned char datalen){
    switch (buffer_no){
        default:
            C1TX0B1 = C1TX0B2 = C1TX0B3 = C1TX0B4 = 0x0000; /* 送信バッファ初期化 */
            switch (datalen){
                case 8:
                    C1TX0B4 = data[7];
                    C1TX0B4 <<= 8;
                case 7:
                    C1TX0B4 |= data[6];
                case 6:
                    C1TX0B3 = data[5];
                    C1TX0B3 <<= 8;
                case 5:
                    C1TX0B3 |= data[4];
                case 4:
                    C1TX0B2 = data[3];
                    C1TX0B2 <<= 8;
                case 3:
                    C1TX0B2 |= data[2];
                case 2:
                    C1TX0B1 = data[1];
                    C1TX0B1 <<= 8;
                default:
                    C1TX0B1 |= data[0];
                    break;
            }
            break;
        case 1:
            C1TX1B1 = C1TX1B2 = C1TX1B3 = C1TX1B4 = 0x0000;
            switch (datalen){
                case 8:
                    C1TX1B4 = data[7];
                    C1TX1B4 <<= 8;
                case 7:
                    C1TX1B4 |= data[6];
                case 6:
                    C1TX1B3 = data[5];
                    C1TX1B3 <<= 8;
                case 5:
                    C1TX1B3 |= data[4];
                case 4:
                    C1TX1B2 = data[3];
                    C1TX1B2 <<= 8;
                case 3:
                    C1TX1B2 |= data[2];
                case 2:
                    C1TX1B1 = data[1];
                    C1TX1B1 <<= 8;
                default:
                    C1TX1B1 |= data[0];
                    break;
            }
            break;
        case 2:
            C1TX2B1 = C1TX2B2 = C1TX2B3 = C1TX2B4 = 0x0000;
            switch (datalen){
                case 8:
                    C1TX2B4 = data[7];
                    C1TX2B4 <<= 8;
                case 7:
                    C1TX2B4 |= data[6];
                case 6:
                    C1TX2B3 = data[5];
                    C1TX2B3 <<= 8;
                case 5:
                    C1TX2B3 |= data[4];
                case 4:
                    C1TX2B2 = data[3];
                    C1TX2B2 <<= 8;
                case 3:
                    C1TX2B2 |= data[2];
                case 2:
                    C1TX2B1 = data[1];
                    C1TX2B1 <<= 8;
                default:
                    C1TX2B1 |= data[0];
                    break;
            }
            break;
    }
}

static void CAN1_send_buffer_16(unsigned char buffer_no, unsigned int *data, unsigned char datalen){
    switch (buffer_no){
        default:
            C1TX0B1 = C1TX0B2 = C1TX0B3 = C1TX0B4 = 0x0000;
            switch (datalen){
                case 8: case 7:
                    C1TX0B4 = data[3];
                case 6: case 5:
                    C1TX0B3 = data[2];
                case 4: case 3:
                    C1TX0B2 = data[1];
                default:
                    C1TX0B1 = data[0];
                    break;
            }
            break;
        case 1:
            C1TX1B1 = C1TX1B2 = C1TX1B3 = C1TX1B4 = 0x0000;
            switch (datalen){
                case 8: case 7:
                    C1TX1B4 = data[3];
                case 6: case 5:
                    C1TX1B3 = data[2];
                case 4: case 3:
                    C1TX1B2 = data[1];
                default:
                    C1TX1B1 = data[0];
                    break;
            }
            break;
        case 2:
            C1TX2B1 = C1TX2B2 = C1TX2B3 = C1TX2B4 = 0x0000;
            switch (datalen){
                case 8: case 7:
                    C1TX2B4 = data[3];
                case 6: case 5:
                    C1TX2B3 = data[2];
                case 4: case 3:
                    C1TX2B2 = data[1];
                default:
                    C1TX2B1 = data[0];
                    break;
            }
            break;
    }
}

static void CAN1_send_buffer_32(unsigned char buffer_no, unsigned long *data, unsigned char datalen){
    switch (buffer_no){
        default:
            C1TX0B1 = C1TX0B2 = C1TX0B3 = C1TX0B4 = 0x0000;
            switch (datalen){
                case 8: case 7:
                    C1TX0B4 = (unsigned int)((data[1] & 0xFFFF0000) >> 16);
                case 6: case 5:
                    C1TX0B3 = (unsigned int)(data[1] & 0xFFFF);
                case 4: case 3:
                    C1TX0B2 = (unsigned int)((data[0] & 0xFFFF0000) >> 16);
                default:
                    C1TX0B1 = (unsigned int)(data[0] & 0xFFFF);
                    break;
            }
            break;
        case 1:
            C1TX1B1 = C1TX1B2 = C1TX1B3 = C1TX1B4 = 0x0000;
            switch (datalen){
                case 8: case 7:
                    C1TX1B4 = (unsigned int)((data[1] & 0xFFFF0000) >> 16);
                case 6: case 5:
                    C1TX1B3 = (unsigned int)(data[1] & 0xFFFF);
                case 4: case 3:
                    C1TX1B2 = (unsigned int)((data[0] & 0xFFFF0000) >> 16);
                default:
                    C1TX1B1 = (unsigned int)(data[0] & 0xFFFF);
                    break;
            }
            break;
        case 2:
            C1TX2B1 = C1TX2B2 = C1TX2B3 = C1TX2B4 = 0x0000;
            switch (datalen){
                case 8: case 7:
                    C1TX2B4 = (unsigned int)((data[1] & 0xFFFF0000) >> 16);
                case 6: case 5:
                    C1TX2B3 = (unsigned int)(data[1] & 0xFFFF);
                case 4: case 3:
                    C1TX2B2 = (unsigned int)((data[0] & 0xFFFF0000) >> 16);
                default:
                    C1TX2B1 = (unsigned int)(data[0] & 0xFFFF);
                    break;
            }
            break;
    }
}

