cya-ga-umai/CAN_for_dsPIC30F4012/my_can.c
/******************************************************************************
 * CAN1モジュールメッセージ受信関数
 ******************************************************************************/
void CAN1_read_message_8(unsigned char buffer_no, unsigned char *data){
    switch (buffer_no){
        default:
            while(!CAN1RX0Flag);
            CAN1_read_buffer_8(0, data);
            C1INTFbits.RX0IF    = 0;
            C1RX0CONbits.RXFUL  = 0;
            CAN1RX0Flag         = 0;
            break;
        case 1:
            while(!CAN1RX1Flag);
            CAN1_read_buffer_8(1, data);
            C1INTFbits.RX1IF    = 0;
            C1RX1CONbits.RXFUL  = 0;
            CAN1RX1Flag         = 0;
            break;
    }
}

void CAN1_read_message_16(unsigned char buffer_no, unsigned int *data){
    switch (buffer_no){
        default:
            while(!CAN1RX0Flag);
            CAN1_read_buffer_16(0, data);
            C1INTFbits.RX0IF    = 0;
            C1RX0CONbits.RXFUL  = 0;
            CAN1RX0Flag         = 0;
            break;
        case 1:
            while(!CAN1RX1Flag);
            CAN1_read_buffer_16(1, data);
            C1INTFbits.RX1IF    = 0;
            C1RX1CONbits.RXFUL  = 0;
            CAN1RX1Flag         = 0;
            break;
    }
}

void CAN1_read_message_32(unsigned char buffer_no, unsigned long *data){
    switch (buffer_no){
        default:
            while(!CAN1RX0Flag);
            CAN1_read_buffer_32(0, data);
            C1INTFbits.RX0IF    = 0;
            C1RX0CONbits.RXFUL  = 0;
            CAN1RX0Flag         = 0;
            break;
        case 1:
            while(!CAN1RX1Flag);
            CAN1_read_buffer_32(1, data);
            C1INTFbits.RX1IF    = 0;
            C1RX1CONbits.RXFUL  = 0;
            CAN1RX1Flag         = 0;
            break;
    }
}

/******************************************************************************
 * CAN1モジュール受信バッファ読み出し関数（スタティック）
 ******************************************************************************/
static void CAN1_read_buffer_8(unsigned char buffer_no, unsigned char *data){
    switch (buffer_no){
        default:
            switch (C1RX0DLCbits.DLC){
                case 8:
                    data[7] = (C1RX0B4 >> 8) & 0xFF;
                case 7:
                    data[6] = C1RX0B4 & 0xFF;
                case 6:
                    data[5] = (C1RX0B3 >> 8) & 0xFF;
                case 5:
                    data[4] = C1RX0B3 & 0xFF;
                case 4:
                    data[3] = (C1RX0B2 >> 8) & 0xFF;
                case 3:
                    data[2] = C1RX0B2 & 0xFF;
                case 2:
                    data[1] = (C1RX0B1 >> 8) & 0xFF;
                default:
                    data[0] = C1RX0B1 & 0xFF;
                    break;
            }
            break;
        case 1:
            switch (C1RX1DLCbits.DLC){
                case 8:
                    data[7] = (C1RX1B4 >> 8) & 0xFF;
                case 7:
                    data[6] = C1RX1B4 & 0xFF;
                case 6:
                    data[5] = (C1RX1B3 >> 8) & 0xFF;
                case 5:
                    data[4] = C1RX1B3 & 0xFF;
                case 4:
                    data[3] = (C1RX1B2 >> 8) & 0xFF;
                case 3:
                    data[2] = C1RX1B2 & 0xFF;
                case 2:
                    data[1] = (C1RX1B1 >> 8) & 0xFF;
                default:
                    data[0] = C1RX1B1 & 0xFF;
                    break;
            }
            break;
    }
}

static void CAN1_read_buffer_16(unsigned char buffer_no, unsigned int *data){
    switch (buffer_no){
        default:
            switch (C1RX0DLCbits.DLC){
                case 8: case 7:
                    data[3] = C1RX0B4;
                case 6: case 5:
                    data[2] = C1RX0B3;
                case 4: case 3:
                    data[1] = C1RX0B2;
                default:
                    data[0] = C1RX0B1;
                    break;
            }
            break;
        case 1:
            switch (C1RX1DLCbits.DLC){
                case 8: case 7:
                    data[3] = C1RX1B4;
                case 6: case 5:
                    data[2] = C1RX1B3;
                case 4: case 3:
                    data[1] = C1RX1B2;
                default:
                    data[0] = C1RX1B1;
                    break;
            }
            break;
    }
}

static void CAN1_read_buffer_32(unsigned char buffer_no, unsigned long *data){
    switch (buffer_no){
        default:
            data[0] = data[1] = 0x00000000;
            switch (C1RX0DLCbits.DLC){
                case 8: case 7:
                    data[1] = C1RX0B4;
                    data[1] <<= 16;
                case 6: case 5:
                    data[1] |= C1RX0B3;
                case 4: case 3:
                    data[0] = C1RX0B2;
                    data[0] <<= 16;
                default:
                    data[0] |= C1RX0B1;
                    break;
            }
            break;
        case 1:
            data[0] = data[1] = 0x00000000;
            switch (C1RX1DLCbits.DLC){
                case 8: case 7:
                    data[1] = C1RX1B4;
                    data[1] <<= 16;
                case 6: case 5:
                    data[1] |= C1RX1B3;
                case 4: case 3:
                    data[0] = C1RX1B2;
                    data[0] <<= 16;
                default:
                    data[0] |= C1RX1B1;
                    break;
            }
            break;
    }
}

/******************************************************************************
 * CAN1モジュール割り込み処理関数
 ******************************************************************************/
void __attribute__((interrupt, no_auto_psv)) _C1Interrupt(void) {
    /* 送信バッファ0割り込み */
    if (C1INTFbits.TX0IF) C1INTFbits.TX0IF = 0;
    
    /* 送信バッファ1割り込み */
    if (C1INTFbits.TX1IF) C1INTFbits.TX1IF = 0;
    
    /* 送信バッファ2割り込み */
    if (C1INTFbits.TX2IF) C1INTFbits.TX2IF = 0;
    
    /* 受信バッファ0割り込み */
    if (C1INTFbits.RX0IF) {
        CAN1RX0Flag = 1;
    }
    
    /* 受信バッファ1割り込み */
    if (C1INTFbits.RX1IF) {
        CAN1RX1Flag = 1;
    }
    
    /* バスウェイクアップ動作割り込み */
    if (C1INTFbits.WAKIF) C1INTFbits.WAKIF = 0; // Add wake-up handler code
    
    /* エラー割り込み */
    if (C1INTFbits.ERRIF) C1INTFbits.ERRIF = 0; // Add error handler code
    
    /* 無効メッセージ受信割り込み */
    if (C1INTFbits.IVRIF) C1INTFbits.IVRIF = 0;
    
    /* CAN1割り込みフラグを解除 */
    //if ((C1INTF & C1INTE) == 0) IFS1bits.C1IF = 0;
    IFS1bits.C1IF = 0;
}
